Repository: hugues31/cnc_opticut
Catalog: lib/src/localization/app_*.arb
Languages: fr

# materialsList
source: List of materials
fr: Liste des matériaux

source: Material selection:
fr: Sélection du matériau :

source: Theme mode:
fr: Choix du thème :

source: Settings
fr: Paramètres

source: System default
fr: Paramètres par défaut

source: Light theme
fr: Thème clair

source: Dark theme
fr: Thème sombre

# selectMaterialLabel
source: {type, select, softWood {Soft Wood / Mdf} hardWood {Hard Wood / CTP} brass {Brass} Aluminium_Lub_Si_Less_Than_10 {Aluminium+Lub, Si<10%} Alpax_Lub_Si_Greater_Than_10 {Alpax+Lub, Si>10%} other {no_name} }
fr: {type, select, softWood {Bois tendre / Mdf} hardWood {Bois dur / CTP} brass {Laiton} Aluminium_Lub_Si_Less_Than_10 {Aluminium+Lub, Si<10%} Alpax_Lub_Si_Greater_Than_10 {Alpax+Lub, Si>10%} other {no_name} }

# selectMaterialDesc
source: {type, select, softWood {Spruce, Scots pine, fir, alder... Knotless.} hardWood {Oak, maple, eucalyptus, beech... Knotless.} PVC {Expanded PVC. Use a special PVC cutter.} POM {POM/PMMA/PC. Use a special POM/PMMA/PC cutter.} Aluminium_Lub_Si_Less_Than_10 {Aluminum with lubrication where the silicon content in the alloy does not exceed 10%. Only for very rigid machines.} Alpax_Lub_Si_Greater_Than_10 {Aluminum or Alpax with lubrication where the silicon content in the alloy is greater than 10%. Only for very rigid machines.} other {no_desc} }
fr: {type, select, softWood {Bois tendre : épicéa, pin sylvestre, sapin, aulne... Sans noeud.} hardWood {Chêne, érable, eucalyptus, hêtre... Sans noeud.} PVC {PVC expansé. Utiliser une fraise spéciale PVC.} POM {POM/PMMA/PC. Utiliser une fraise spéciale POM/PMMA/PC.} Aluminium_Lub_Si_Less_Than_10 {Aluminium avec lubrification dont le taux de silicium dans l'alliage ne dépasse pas 10%. Seulement pour machine très rigide.} Alpax_Lub_Si_Greater_Than_10 {Aluminium ou Alpax avec lubrication dont le taux de silicium dans l'alliage dépasse 10%. Seulement pour machine très rigide.} other {no_desc} }

# particleBoard
source: Soft wood / MDF
fr: Bois tendre / MDF

# wood
source: Hard wood / CTP
fr: Bois dur / CTP

source: Brass
fr: Laiton

# materialDesc
source: Material '{name}' has the following properties:
fr: Le matériau '{name}' a les propriétés suivantes :

# cuttingSpeedHSS
source: Cutting speed (HSS): {cutSpeedHss}
fr: Vitesse de coupe (HSS): {cutSpeedHss}

# cuttingSpeedCarbide
source: Cutting speed (carbide): {cutSpeedCarbide}
fr: Vitesse de coupe (carbure): {cutSpeedCarbide}

source: Carbide
fr: Carbure

# chooseNumberOfPoles
source: Choose the number of poles (Pp):
fr: Choisissez le nombre de pôles (Pp) :

# chooseNumberOfTeeth
source: Choose the number of teeth (Z):
fr: Choisissez le nombre de dents (Z) :

source: Cutting parameters
fr: Paramètres de coupe

source: Drilling bit type:
fr: Type de foret :

# chooseDiameter
source: Cutter diameter:
fr: Diamètre de la fraise :

source: Diameter
fr: Diamètre

# deleteDb
source: Delete database
fr: Supprimer la base de donnée

# deleteDbConfirmation
source: Are you sure you want to delete the database?
fr: Etes-vous sûr de vouloir supprimer la base de donnée ?

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

# dbDeleted
source: Database deleted
fr: Base de donnée supprimée

# apInfo
source: Depth per pass : depth of material machined at each pass.
fr: Profondeur de coupe : profondeur de matière usinée à chaque passe.

source: Formula
fr: Formule

source: Unit
fr: Unité

# dInfo
source: Diameter of the cutting part of the cutting tool.
fr: Diamètre de la partie coupante de la fraise.

# fzInfo
source: Chip load : thickness of chip that a tooth can evacuate in one rotation.
fr: Avance par dent : épaisseur de copeau que peut évacuer une dent en une rotation.

source: teeth
fr: dent

# deleteMaterialConfirmation
source: Are you sure you want to delete the material '{name}'?
fr: Etes-vous sûr de vouloir supprimer le matériau '{name}' ?

source: Add material
fr: Ajouter un matériau

# addMaterialPrompt
source: Enter material name
fr: Nom du matériau

source: Add
fr: Ajouter

# materialAdded
source: Material '{name}' added
fr: Matériau '{name}' créé.

# pleaseEnterName
source: Please enter a name
fr: Entrez un nom.

# nameExists
source: Name '{name}' already exists
fr: Le nom '{name}' existe déjà.

source: Edit
fr: Éditer

# editDisabled
source: Material is not editable
fr: Matériau non éditable

source: Select image source
fr: Source de l'image

# selectImageSourceDesc
source: Choose where to get the image from
fr: Choisissez la source de l'image pour le matériau

source: Camera
fr: Caméra

source: Gallery
fr: Gallerie

# addImage
source: Add a picture
fr: Ajouter une image

# addMachinePrompt
source: Enter machine name
fr: Nom de la machine

# deleteMachineConfirmation
source: Are you sure you want to delete the machine '{name}'?
fr: Etes-vous sûr de vouloir supprimer la machine '{name}' ?

# machinesList
source: List of machines
fr: Liste des machines

# addTool
source: Add cutter tool
fr: Ajouter une fraise

# addToolPrompt
source: Enter cutter tool name
fr: Nom de la fraise

# deleteToolConfirmation
source: Are you sure you want to delete the cutter tool '{name}'?
fr: Etes-vous sûr de vouloir supprimer la fraise '{name}' ?

# toolsList
source: List of cutter tools
fr: Liste des fraises

source: Tool material
fr: Matériau de la fraise

# rigidityCoefficient
source: Rigidity coefficient (Kr)
fr: Coefficient de rigidité

# maxSpindleRotationSpeed
source: Maximum spindle rotation speed (RPM)
fr: Vitesse maximale de rotation de la broche (rpm)

# maxAxisFeedSpeed
source: Maximum axis feed speed (mm/min)
fr: Vitesse maximale d'avance des axes (mm/min)

# polePairs
source: Pole pairs (Pp)
fr: Paires de pôle (Pp)

source: Spindle rotation speed
fr: Vitesse de rotation de la broche

source: Feed speed
fr: Vitesse d'avance

# maxZFeedSpeed
source: Maximum Z feed speed
fr: Vitesse maximale d'avance en Z

source: Depth of cut
fr: Profondeur de passe

source: Close
fr: Fermer
